aeropython-1.org
#+TITLE:Appunti di Aerodinamica
#+AUTHOR:Marco Callari

* Concetti base
** Punto di vista Lagrangiano
Seguo un volume di controllo nello spazio e ne descrivo l'evoluzione
** Punto di vista Euleriano
Fisso gli occhi su un punto in specifico e ne descrivo l'evoluzione
** Differenziale di una funzione
    Data una funzione $f$ = $f(x)$ il suo differenziale $df$ è definito come:
    \begin{gather*}
    df(x,\Delta x) = \frac{df}{dx} \Delta x
    \end{gather*}
** Derivazione derivata materiale
Usata per esprimere la variazione di una proprietà del fluido da un punto di vista Lagrangiano (ovvero seguendo  l'evoluzione di un volume infitesimo di fluido)
Definita come:
\begin{gather*}
\frac{Df}{Dx} \equiv \lim_{x_2 \rightarrow x_1} \frac{f(x_2) - f(x_1)}{x_2 - x_1}
\end{gather*}
Data una funzione $f = f(x,y,z,t)$, posso approssimare il suo valore in un punto $P_2$ $\rightarrow$ $P_1$ all'istante $t_2$ $\rightarrow$ $t_1$ tramite una serie di Taylor al primo ordine:
\begin{gather*}
f(x_2,y_2,z_2,t_2) = f(x_1,y_1,z_1,t_1) + \frac{\partial f}{\partial x} (x_2-x_1) + \frac{\partial f}{\partial y} (y_2 - y_1) + \frac{\partial f}{\partial z} (z_2 - z_1) + \frac{\partial f}{\partial t} (t_2 - t_1)
\end{gather*}
Dividendo per $(t_2 - t_1)$ :
\begin{gather*}
\frac{f(x_2,y_2,z_2,t_2) - f(x_1,y_1,z_1,t_1)}{t_2 - t_1} = \frac{\partial f}{\partial x} u + \frac{\partial f}{\partial y} v + \frac{\partial f}{\partial z} w + \frac{\partial f}{\partial t}
\end{gather*}
Ovvero:
\begin{gather*}
\frac{Df}{Dt} = \frac{\partial f}{\partial t} + \frac{\partial f}{\partial x} u + \frac{\partial f}{\partial y} v + \frac{\partial f}{\partial z} w
\end{gather*}
Dove $u$, $v$, $w$, sono le velocità in direzione $x$, $y$, $z$
Può essere espressa anche come:
\begin{gather*}
\frac{Df}{Dt} = \frac{\partial f}{\partial t} + \vec{v} \cdot \nabla f
\end{gather*}

** Teorema del trasporto di Reynolds
    Data:
        - Una funzione $f$ che dipende da spazio e tempo $f(x,t)$
    Di cui voglio calcolare la derivata nel tempo dell'integrale nel volume di controllo $\Omega(t)$ (nota: variabile nel tempo), ovvero:
    \begin{gather*}
    \frac{d}{dt} \int_{\Omega(t)} f \,dV
    \end{gather*}
    Utilizzando il teorema di Reynolds, è possibile riscrivere questa derivata di un integrale come:
    \begin{gather*}
    \frac{d}{dt} \int_{\Omega(t)} f \,dV = \int_{\Omega(t)}{\frac{\partial f}{\partial t}\,dV} + \int_{\partial\Omega(t)}{(v^b \cdot n)f\,dA}
    \end{gather*}
    Dove:
        - $\partial \Omega(t)$ è la superficie esterna del volume di controllo (superficie di controllo)
        - $n$ è il versore normale alla superficie $\delta \Omega(t)$
        - $v^b(x,t)$ è la velocità dell'elemento di area

** Equazione di conservazione della massa
    Derivata dal un punto di vista EULERIANO. Considero un volume infinitesimo che circonda un punto $x$:
    @TODO aggiungere immagine
    Definisco $\dot{m}(x)$ portata di fluido nel punto $x$. Usando una serie di Taylor, posso descrivere la portata uscente dalla parete di destra del volume di controllo come:
    \begin{gather*}
    \dot{m}(x+\frac{dx}{2}) =\dot{m}(x) + \frac{\partial \dot{m}}{\partial x} \frac{dx}{2}
    \end{gather*}
    In maniera analoga, la massa uscente dalla parete sinistra del volume di controllo:
    \begin{gather*}
    \dot{m}(x-\frac{dx}{2}) =\dot{m}(x) - \frac{\partial \dot{m}}{\partial x} \frac{dx}{2}
    \end{gather*}
    Prendendo in considerazione esclusivamente l'asse $x$, la variazione di massa per unità di tempo risulta essere uguale a:
    \begin{gather*}
    \dot{m}(x+\frac{dx}{2}) - \dot{m}(x-\frac{dx}{2}) =\frac{\partial \dot{m}}{\partial x} dx
    \end{gather*}
    Dato che $\dot{m} = \rho u dy dz$
    \begin{gather*}
    \dot{m}(x+\frac{dx}{2}) - \dot{m}(x-\frac{dx}{2}) =\frac{\partial (\rho u)}{\partial x} dx dy dz
    \end{gather*}
    Eseguendo in maniera analoga gli stessi calcoli anche per l'asse y e l'asse z, la variazione totale di massa per unità di tempo nel volume di controllo risulta essere:
    \begin{gather*}
    (\frac{\partial (\rho u)}{\partial x} + \frac{\partial (\rho v)}{\partial y} + \frac{\partial (\rho w)}{\partial z}) dx dy dz
    \end{gather*}
    Visto che stiamo analizzando il volume di controllo da un punto di vista Euleriano, la variazione di massa può essere descritta come:
    \begin{gather*}
    \frac{dm}{dt} = \frac{d \rho}{dt} dx dy dz
    \end{gather*}
    Combinando le due equazioni:
    \begin{gather*}
    - \frac{d \rho}{dt} = \frac{\partial (\rho u)}{\partial x} + \frac{\partial (\rho v)}{\partial y} + \frac{\partial (\rho w)}{\partial z}
    \end{gather*}
    (Aggiunto un - in quanto il primo termine è negativo quando la massa del volume di controllo diminusce, mentre il secondo, in questo caso, è positivo)
    Concludendo,
    \begin{gather*}
    \frac{d \rho}{dt} + \nabla \cdot (\rho \vector{v})= 0
    \end{gather*}
** Equazione di conservazione della quantità di moto
@TODO
** Fluido incomprimibile $\rightarrow$ $\nabla \cdot \vector{v}$ = 0
Data l'equazione di conservazione della massa,
    \begin{gather*}
    \frac{d \rho}{dt} + \nabla \cdot (\rho \vector{v})= 0
    \end{gather*}
    Imponendo $\rho$ = const., ricavo che:
    \begin{gather*}
    \rho \nabla \cdot \vector{v}= 0
    \end{gather*}
    Ergo,
    \begin{gather*}
    \nabla \cdot \vector{v}= 0
    \end{gather*}
